#### Terraform Init: ✅
#### Terraform Format: ✅
#### Terraform Validate: ✅
#### Terraform Plan: ✅

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure.azurerm_network_security_group.nsg1 will be created
  + resource "azurerm_network_security_group" "nsg1" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "chrsdrhm-nsg1"
      + resource_group_name = "chrsdrhm-rg1"
      + security_rule       = (known after apply)
    }

  # module.azure.azurerm_resource_group.rg1 will be created
  + resource "azurerm_resource_group" "rg1" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "chrsdrhm-rg1"
      + tags     = {
          + "Environment" = "Production"
          + "Provisioner" = "Terraform"
        }
    }

  # module.azure.azurerm_virtual_network.vnet1 will be created
  + resource "azurerm_virtual_network" "vnet1" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = [
          + "8.8.8.8",
        ]
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "chrsdrhm-vnet1"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "chrsdrhm-rg1"
      + subnet                         = [
          + {
              + address_prefixes                              = [
                  + "10.0.1.0/24",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "chrsdrhm-subnet1"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + security_group                                = (known after apply)
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (1 unchanged attribute hidden)
            },
          + {
              + address_prefixes                              = [
                  + "10.0.2.0/24",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "chrsdrhm-subnet2"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + security_group                                = (known after apply)
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                           = {
          + "Environment" = "Production"
          + "Provisioner" = "Terraform"
        }
    }

  # module.entra.azuread_group.demo-group will be created
  + resource "azuread_group" "demo-group" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "chrsdrhm-demo-group"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + types                          = [
          + "DynamicMembership",
        ]
      + visibility                     = (known after apply)
      + writeback_enabled              = false

      + dynamic_membership {
          + enabled = true
          + rule    = "user.department -eq \"Engineering\""
        }
    }

  # module.intune.microsoft365wp_device_compliance_policy.android_compliance will be created
  + resource "microsoft365wp_device_compliance_policy" "android_compliance" {
      + android_work_profile       = {
          + advanced_threat_protection_required_security_level       = "unavailable"
          + device_threat_protection_enabled                         = false
          + device_threat_protection_required_security_level         = "unavailable"
          + min_android_security_patch_level                         = "2025-05-01"
          + password_required                                        = false
          + password_required_type                                   = "deviceDefault"
          + required_password_complexity                             = "none"
          + security_block_jailbroken_devices                        = true
          + security_disable_usb_debugging                           = false
          + security_prevent_install_apps_from_unknown_sources       = false
          + security_require_company_portal_app_integrity            = false
          + security_require_google_play_services                    = false
          + security_require_safety_net_attestation_basic_integrity  = false
          + security_require_safety_net_attestation_certified_device = false
          + security_require_up_to_date_security_providers           = false
          + security_require_verify_apps                             = false
          + security_required_android_safety_net_evaluation_type     = "basic"
          + storage_require_encryption                               = false
          + work_profile_password_required_type                      = "deviceDefault"
          + work_profile_require_password                            = false
          + work_profile_required_password_complexity                = "none"
        }
      + assignments                = [
          + {
              + target = {
                  + filter_id   = (known after apply)
                  + filter_type = "none"
                  + group       = {
                      + group_id = (known after apply)
                    }
                }
            },
        ]
      + created_date_time          = (known after apply)
      + description                = <<-EOT
            Compliance policy for Android devices.
            {"Environment":"Production","Provisioner":"Terraform"}
        EOT
      + display_name               = "Android Compliance Policy"
      + id                         = (known after apply)
      + last_modified_date_time    = (known after apply)
      + role_scope_tag_ids         = [
          + "0",
        ]
      + scheduled_actions_for_rule = [
          + {
              + scheduled_action_configurations = [
                  + {
                      + action_type                  = "block"
                      + grace_period_hours           = 0
                      + notification_message_cc_list = []
                      + notification_template_id     = "00000000-0000-0000-0000-000000000000"
                    },
                ]
            },
        ]
      + version                    = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Actor: @chrsdrhm
Trigger: `pull_request`